RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_adcmic.h
/***************************************************************************//**
* \file cy_adcmic.h
* \version 0.1
*
* Provides an API declaration of the ADCMic driver.
*
********************************************************************************
* \copyright
* Copyright 2022 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_adcmic
* \{
* ADCMic driver is used to process analog and digital microphone signal and 
* DC signal with the mxs40adcmic IP. This IP interfaces with Delta-Sigma modulator part 
* of the s40adcmic and implements CIC, decimation (FIR) and biquad filters.
* The ADC result is read by the CPU or the DMA from the FIFO of mxs40adcmic 
* (and from CIC register for DC measurement). Instead of taking modulator data
* from s40adcmic, mxs40adcmic can also be configured to take PDM input
* directly from an external digital microphone.
*
* \image html ADCMicBlockDiagram.png
*
* Consult the datasheet of your device for details of the
* clock system.
*
* The high level features of the subsystem are:
*   - Analog (MIC) and digital (PDM) microphones support.
*   - Sample rate 8/16 ksps for audio (microphones) and 480 ksps for DC measurement.
*   - Configurable biquad filter for custom audio equalization.
*   - Selectable DC measurement range.
*   - interrupt & trigger generation.
*   - built-in FIFO buffer (for audio only).
*
* \section group_adcmic_usage Usage
*
* The high level steps to use this driver are:
*
*   -# \ref group_adcmic_initialization
*   -# \ref group_adcmic_clock
*   -# \ref group_adcmic_trigger
*   -# \ref group_adcmic_timer
*   -# \ref group_adcmic_interrupt
*   -# \ref group_adcmic_dc_result
*   -# \ref group_adcmic_fifo
*
* \section group_adcmic_initialization Initialization and Enabling
*
* To configure the ADCMic subsystem call \ref Cy_ADCMic_Init.
* Pass in a pointer to the \ref MXS40ADCMIC_Type structure for the base hardware register address and 
* pass in the configuration structure \ref cy_stc_adcmic_config_t.
*
* After initialization, call \ref Cy_ADCMic_Enable to enable the block.
*
* \subsection group_adcmic_mic Analog Microphone (MIC) Mode
*
* \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_MIC
* \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_MIC_OP
*
* Usually the MIC mode is used with FIFO, see \ref group_adcmic_fifo
*
* \subsection group_adcmic_pdm Digital Microphone (PDM) Mode
*
* \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_PDM
* \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_PDM_OP
*
* Usually the MIC mode is used with FIFO, see \ref group_adcmic_fifo
*
* \subsection group_adcmic_dc DC Measurement (DC) Mode
*
* \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_DC
* \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_DC_OP

* \subsection group_adcmic_biquad Biquad filter Initialization
*
* The biquad filter usually is used to the audio stream equalization (in MIC or PDM modes):
* \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_BIQUAD
* \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_BIQUAD_INIT
*
* \section group_adcmic_clock Clocks
*
* The ADCMic requires two input clocks: 
* - clk_sys - recommended frequency is 96MHz, usually is routed from one of the \ref group_sysclk_clk_hf
* - clk_hf - recommended frequency is 24MHz, usually is routed from one of the \ref group_sysclk_clk_hf
* 
* For more exact information on the ADCMic clock routing, refer to the datasheet for your device.
*
* The internal dividers are configured by \ref cy_stc_adcmic_config_t::clockDiv for general ADC functional and
* \ref cy_stc_adcmic_audio_digital_path_config_t::clockDiv for the PDM data latching.
*
* \section group_adcmic_trigger Triggering
*
* The ADCMic subsystem has two output triggers: from the timer and from the FIFO,
* they could be configured by the \ref cy_stc_adcmic_timer_trigger_config_t::timerTrigger and
* \ref cy_stc_adcmic_timer_trigger_config_t::fifoTrigger fields.
*
* Also, they could be routed to any periphery using \ref group_trigmux driver, e.g. to DW block:
* \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_TRIGGER
*
* \section group_adcmic_timer Timer
*
* The Timer can be used for two purposes:
* - generate periodic events based on ADCMic clk_sys clock.
* - count the CIC data update events.
* 
* The timer period and input signal source are configured by the \ref cy_stc_adcmic_timer_trigger_config_t::period and
* \ref cy_stc_adcmic_timer_trigger_config_t::input fields correspondingly.
*
* \section group_adcmic_interrupt Handling Interrupts
*
* The ADCMic subsystem has two interrupt sources: the timer and the FIFO.
* The FIFO interrupt can have several reasons, see \ref group_adcmic_macros_fifo_status
*
* The ADCMic interrupt to the NVIC is raised any time the intersection (logic and) of the interrupt
* flags and the corresponding interrupt masks are non-zero.
*
* Implement an interrupt routine and assign it to the ADCMic interrupt.
* Use the pre-defined enumeration, adcmic_interrupt_adcmic_IRQn, as the interrupt source for the ADCMic.
*
* The following code snippet demonstrates how to implement a routine to handle the interrupt.
* The routine gets called when any one of the ADCMic interrupts are triggered.
* When servicing an interrupt, the user must clear the interrupt so that subsequent
* interrupts can be handled.
*
* The following code snippet demonstrates how to configure and enable the interrupt.
* \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_ISR
* \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_CONFIG_INTR
*
* Alternately, instead of handling the interrupts, the \ref Cy_ADCMic_IsEndConversion function
* allows for firmware polling of the end of DC conversion status.
*
* \section group_adcmic_dc_result Retrieve DC Measurement Results
*
* Retrieve the ADC result by calling \ref Cy_ADCMic_GetDcResult with the desired channel.
* To convert the result to a voltage, pass the ADC result to \ref Cy_ADCMic_CountsTo_Volts, \ref Cy_ADCMic_CountsTo_mVolts, or
* \ref Cy_ADCMic_CountsTo_uVolts.
*
* \section group_adcmic_fifo FIFO Usage
*
* The ADCMic subsystem in MIC and PDM modes stores the audio data into the FIFO 
* It can be configured using \ref cy_stc_adcmic_fifo_config_t, and served either by ISR:
* \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_ISR
* Or by DMA:
* \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_TRIGGER
*
* \section group_adcmic_more_information More Information
* For more information on the ADCMic ADC subsystem, refer to the datasheet of your device.
*
* \section group_adcmic_changelog Changelog
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td>0.1</td>
*     <td>This is a pre-production driver release. The driver is not recommended for production use, unless the functionality is delivered in Cypress-provided applications.</td>
*     <td>Pre-production support of the CAT1B Devices</td>
*   </tr>
* </table>
*
* \defgroup group_adcmic_macros Macros
* \{
*   \defgroup group_adcmic_macros_interrupt        Interrupt Masks
*   \defgroup group_adcmic_macros_triggers         Triggers
*   \defgroup group_adcmic_macros_reg_pointers     Register Pointers
*   \defgroup group_adcmic_macros_fifo_status      FIFO Status Masks
*   \defgroup group_adcmic_macros_fifo_samples     FIFO Samples definitions
*   \defgroup group_adcmic_macros_dc_measurement   DC measurement definitions
* \}
* \defgroup group_adcmic_enums Enumerated Types
* \defgroup group_adcmic_data_structures Data Structures
* \defgroup group_adcmic_functions Functions
* \{
*   \defgroup group_adcmic_functions_basic         Initialization and Basic Functions
*   \defgroup group_adcmic_functions_interrupt     Interrupt Functions
*   \defgroup group_adcmic_functions_fifo          FIFO Functions
*   \defgroup group_adcmic_functions_dc            DC Measurement Functions
*   \defgroup group_adcmic_functions_timer         Timer Functions
*   \defgroup group_adcmic_functions_mic           Analog Microphone (MIC) Functions
* \}
*/

#if !defined (CY_ADCMIC_H)
#define CY_ADCMIC_H

#include "cy_device_headers.h"

