RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_adcmic.h
#if defined (CY_IP_MXS40ADCMIC)

#include "cy_syslib.h"

#if defined(__cplusplus)
extern "C" {
#endif

/**
* \addtogroup group_adcmic_macros
* \{
*/
/** Driver major version */
#define CY_ADCMIC_DRV_VERSION_MAJOR            0

/** Driver minor version */
#define CY_ADCMIC_DRV_VERSION_MINOR            1

/** ADCMic PDL ID */
#define CY_ADCMIC_ID                           CY_PDL_DRV_ID(0x48U)

/**
* \addtogroup group_adcmic_macros_interrupt
* \{
*/

#define CY_ADCMIC_INTR_DC     (MXS40ADCMIC_ADCMIC_INTR_INTERRUPT_DC_Msk)   /**< DC interrupt mask */
#define CY_ADCMIC_INTR_DATA   (MXS40ADCMIC_ADCMIC_INTR_INTERRUPT_DATA_Msk) /**< DATA interrupt mask */
#define CY_ADCMIC_INTR        (CY_ADCMIC_INTR_DC | CY_ADCMIC_INTR_DATA)    /**< Combined interrupt mask */

/** \} group_adcmic_macros_interrupt */

/**
* \addtogroup group_adcmic_macros_triggers
* \{
*/

#define CY_ADCMIC_TRIG_DC     (MXS40ADCMIC_ADCMIC_TRIGGER_CLR_TR_DC_Msk)   /**< DC trigger mask, to be used with \ref Cy_ADCMic_ClearTrigger */
#define CY_ADCMIC_TRIG_DATA   (MXS40ADCMIC_ADCMIC_TRIGGER_CLR_TR_DATA_Msk) /**< DATA trigger mask, to be used with \ref Cy_ADCMic_ClearTrigger */
#define CY_ADCMIC_TRIG        (CY_ADCMIC_TRIG_DC | CY_ADCMIC_TRIG_DATA)    /**< Combined interrupt mask, to be used with \ref Cy_ADCMic_ClearTrigger */

/** \} group_adcmic_macros_triggers */

/**
* \addtogroup group_adcmic_macros_reg_pointers
* \{
*/

/** The pointer to the FIFO data read register, to be used for the DMA data acquisition */
#define CY_ADCMIC_FIFO_DATA_REG_PTR(base)   ((void*)&((base)->ADCMIC_DATA))

/** The pointer to the trigger clearing register, to be used for the DMA data acquisition */
#define CY_ADCMIC_TRIGGER_CLR_REG_PTR(base) ((void*)&((base)->ADCMIC_TRIGGER_CLR))

/** \} group_adcmic_macros_reg_pointers */

/**
* \addtogroup group_adcmic_macros_fifo_status
* \{
*/
#define CY_ADCMIC_FIFO_OVERFLOW     (0x01U)   /**< FIFO overflow status mask */
#define CY_ADCMIC_FIFO_PRG_FULL     (0x02U)   /**< FIFO programmable full status mask */
#define CY_ADCMIC_FIFO_ALMOST_FULL  (0x04U)   /**< FIFO almost full status mask */
#define CY_ADCMIC_FIFO_FULL         (0x08U)   /**< FIFO full status mask */
#define CY_ADCMIC_FIFO_UNDERFLOW    (0x10U)   /**< FIFO underflow status mask */
#define CY_ADCMIC_FIFO_PRG_EMPTY    (0x20U)   /**< FIFO programmable empty status mask */
#define CY_ADCMIC_FIFO_ALMOST_EMPTY (0x40U)   /**< FIFO almost empty status mask */
#define CY_ADCMIC_FIFO_EMPTY        (0x80U)   /**< FIFO empty status mask */
/** \} group_adcmic_macros_fifo_status */

/**
* \addtogroup group_adcmic_macros_fifo_samples
* To be used with low-level API \ref Cy_ADCMic_ReadFifo.
* \{
*/
#define CY_ADCMIC_FIFO_FIRST_SAMPLE_Pos     (0U)           /**< the ADCMIC_DATA first sample position */
#define CY_ADCMIC_FIFO_FIRST_SAMPLE_Msk     (0x0000FFFFUL) /**< the ADCMIC_DATA first sample mask */
#define CY_ADCMIC_FIFO_SECOND_SAMPLE_Pos    (16U)          /**< the ADCMIC_DATA second sample position */
#define CY_ADCMIC_FIFO_SECOND_SAMPLE_Msk    (0xFFFF0000UL) /**< the ADCMIC_DATA second sample mask */
/** \} group_adcmic_macros_fifo_samples */

/**
* \addtogroup group_adcmic_macros_dc_measurement
* To be used for DC measurement voltage calculation/calibration.
* \{
*/
/** The Full Scale counts */
#define CY_ADCMIC_DC_FS         (0xFFFFUL)
/** The coefficient to calculate lower range limit count */
#define CY_ADCMIC_DC_LO         (3U)
/** The coefficient to calculate upper range limit count, scaled by 10000 to avoid fractional math */
#define CY_ADCMIC_DC_HI         (3725U)
/** The default raw count offset for DC measurement */
#define CY_ADCMIC_DC_OFFSET     (-((int16_t)CY_SYSLIB_DIV_ROUND(CY_ADCMIC_DC_FS, CY_ADCMIC_DC_LO)))
/** The upper range limit count */
#define CY_ADCMIC_DC_HI_CNT     ((int16_t)CY_SYSLIB_DIV_ROUND(CY_ADCMIC_DC_FS * CY_ADCMIC_DC_HI, 10000U))
/** The full range counts, scaled by 10 to avoid fractional math */
#define CY_ADCMIC_DC_FS_CNT     ((uint32_t)(CY_ADCMIC_DC_HI_CNT - CY_ADCMIC_DC_OFFSET) * 10U)
/** The default amount of raw counts per 1 volt for 3.6V range */
#define CY_ADCMIC_DC_3_6_GAIN   ((int16_t)CY_SYSLIB_DIV_ROUND(CY_ADCMIC_DC_FS_CNT, 36U))
/** The default amount of raw counts per 1 volt for 1.8V range */
#define CY_ADCMIC_DC_1_8_GAIN   ((int16_t)CY_SYSLIB_DIV_ROUND(CY_ADCMIC_DC_FS_CNT, 18U))
/** The BandGap reference voltage in millivolts */
#define CY_ADCMIC_DC_VBG        (850)
/** \} group_adcmic_macros_dc_measurement */
/** \} group_adcmic_macros */

/** \addtogroup group_adcmic_enums
* \{
*/

/** The ADC error codes */
typedef enum
{
    CY_ADCMIC_SUCCESS                 = 0x00UL,                                      /**< Successful */
    CY_ADCMIC_BAD_PARAM               = CY_ADCMIC_ID | CY_PDL_STATUS_ERROR | 0x01UL, /**< One or more invalid parameters */
    CY_ADCMIC_TIMEOUT                 = CY_ADCMIC_ID | CY_PDL_STATUS_ERROR | 0x02UL, /**< Timeout */
    CY_ADCMIC_CONVERSION_NOT_COMPLETE = CY_ADCMIC_ID | CY_PDL_STATUS_INFO  | 0x03UL, /**< Conversion is not complete */
    CY_ADCMIC_UNKNOWN                 = CY_ADCMIC_ID | CY_PDL_STATUS_ERROR | 0xFFUL, /**< Unknown failure */
} cy_en_adcmic_status_t;


/** The PGA gain settings */
typedef enum
{
    CY_ADCMIC_PGA_GAIN_0  = 0U,  /**<  0 db */
    CY_ADCMIC_PGA_GAIN_1  = 1U,  /**<  1 db */
    CY_ADCMIC_PGA_GAIN_2  = 2U,  /**<  2 db */
    CY_ADCMIC_PGA_GAIN_3  = 3U,  /**<  3 db */
    CY_ADCMIC_PGA_GAIN_4  = 4U,  /**<  4 db */
    CY_ADCMIC_PGA_GAIN_5  = 5U,  /**<  5 db */
    CY_ADCMIC_PGA_GAIN_6  = 6U,  /**<  6 db */
    CY_ADCMIC_PGA_GAIN_7  = 7U,  /**<  7 db */
    CY_ADCMIC_PGA_GAIN_8  = 8U,  /**<  8 db */
    CY_ADCMIC_PGA_GAIN_9  = 9U,  /**<  9 db */
    CY_ADCMIC_PGA_GAIN_10 = 10U, /**< 10 db */
    CY_ADCMIC_PGA_GAIN_11 = 11U, /**< 11 db */
    CY_ADCMIC_PGA_GAIN_12 = 12U, /**< 12 db */
    CY_ADCMIC_PGA_GAIN_13 = 13U, /**< 13 db */
    CY_ADCMIC_PGA_GAIN_14 = 14U, /**< 14 db */
    CY_ADCMIC_PGA_GAIN_15 = 15U, /**< 15 db */
    CY_ADCMIC_PGA_GAIN_16 = 16U, /**< 16 db */
    CY_ADCMIC_PGA_GAIN_17 = 17U, /**< 17 db */
    CY_ADCMIC_PGA_GAIN_18 = 18U, /**< 18 db */
    CY_ADCMIC_PGA_GAIN_19 = 19U, /**< 19 db */
    CY_ADCMIC_PGA_GAIN_20 = 20U, /**< 20 db */
    CY_ADCMIC_PGA_GAIN_21 = 21U, /**< 21 db */
    CY_ADCMIC_PGA_GAIN_22 = 22U, /**< 22 db */
    CY_ADCMIC_PGA_GAIN_23 = 23U, /**< 23 db */
    CY_ADCMIC_PGA_GAIN_24 = 24U, /**< 24 db */
    CY_ADCMIC_PGA_GAIN_25 = 25U, /**< 25 db */
    CY_ADCMIC_PGA_GAIN_26 = 26U, /**< 26 db */
    CY_ADCMIC_PGA_GAIN_27 = 27U, /**< 27 db */
    CY_ADCMIC_PGA_GAIN_28 = 28U, /**< 28 db */
    CY_ADCMIC_PGA_GAIN_29 = 29U, /**< 29 db */
    CY_ADCMIC_PGA_GAIN_30 = 30U, /**< 30 db */
    CY_ADCMIC_PGA_GAIN_31 = 31U, /**< 31 db */
    CY_ADCMIC_PGA_GAIN_32 = 32U, /**< 32 db */
    CY_ADCMIC_PGA_GAIN_33 = 33U, /**< 33 db */
    CY_ADCMIC_PGA_GAIN_34 = 34U, /**< 34 db */
    CY_ADCMIC_PGA_GAIN_35 = 35U, /**< 35 db */
    CY_ADCMIC_PGA_GAIN_36 = 36U, /**< 36 db */
    CY_ADCMIC_PGA_GAIN_37 = 37U, /**< 37 db */
    CY_ADCMIC_PGA_GAIN_38 = 38U, /**< 38 db */
    CY_ADCMIC_PGA_GAIN_39 = 39U, /**< 39 db */
    CY_ADCMIC_PGA_GAIN_40 = 40U, /**< 40 db */
    CY_ADCMIC_PGA_GAIN_41 = 41U, /**< 41 db */
    CY_ADCMIC_PGA_GAIN_42 = 42U  /**< 42 db */
} cy_en_adcmic_pga_gain_t;

/** The signal source */
typedef enum
{
    CY_ADCMIC_DC = 0U,  /**< DC voltage measurement */
    CY_ADCMIC_MIC = 3U, /**< Analog microphone with PGA */
    CY_ADCMIC_PDM = 4U  /**< PDM digital microphone */
} cy_en_adcmic_source_t;

/** The sample rate */
typedef enum
{
    CY_ADCMIC_8KSPS,  /**< 8 ksps, for microphone only */
    CY_ADCMIC_16KSPS, /**< 16 ksps, for microphone only */
    CY_ADCMIC_480KSPS /**< 480 ksps, for DC measurement only */
} cy_en_adcmic_sample_rate_t;

/** The DC channel */
typedef enum
{
    CY_ADCMIC_REFGND = 0x0FU, /**< ADC reference ground */
    CY_ADCMIC_BGREF  = 0x0EU, /**< ADC BG REF */
    CY_ADCMIC_VDDC   = 0x0DU, /**< Core supply */
    CY_ADCMIC_VDDIO  = 0x0CU, /**< Battery/IO supply */
    CY_ADCMIC_GPIO27 = 0x0BU, /**< GPIO 27 */
    CY_ADCMIC_GPIO26 = 0x0AU, /**< GPIO 26 */
    CY_ADCMIC_GPIO25 = 0x09U, /**< GPIO 25 */
    CY_ADCMIC_GPIO24 = 0x08U, /**< GPIO 24 */
    CY_ADCMIC_GPIO23 = 0x07U, /**< GPIO 23 */
    CY_ADCMIC_GPIO22 = 0x06U, /**< GPIO 22 */
    CY_ADCMIC_GPIO21 = 0x05U, /**< GPIO 21 */
    CY_ADCMIC_GPIO20 = 0x04U, /**< GPIO 20 */
    CY_ADCMIC_GPIO19 = 0x03U, /**< GPIO 19 */
    CY_ADCMIC_GPIO18 = 0x02U, /**< GPIO 18 */
    CY_ADCMIC_GPIO17 = 0x01U, /**< GPIO 17 */
    CY_ADCMIC_GPIO16 = 0x00U, /**< GPIO 16 */
    CY_ADCMIC_GPIO15 = 0x1FU, /**< GPIO 15 */
    CY_ADCMIC_GPIO14 = 0x1EU, /**< GPIO 14 */
    CY_ADCMIC_GPIO13 = 0x1DU, /**< GPIO 13 */
    CY_ADCMIC_GPIO12 = 0x1CU, /**< GPIO 12 */
    CY_ADCMIC_GPIO11 = 0x1BU, /**< GPIO 11 */
    CY_ADCMIC_GPIO10 = 0x1AU, /**< GPIO 10 */
    CY_ADCMIC_GPIO9  = 0x19U, /**< GPIO 9  */
    CY_ADCMIC_GPIO8  = 0x18U, /**< GPIO 8  */
    CY_ADCMIC_GPIO7  = 0x17U, /**< GPIO 7  */
    CY_ADCMIC_GPIO6  = 0x16U, /**< GPIO 6  */
    CY_ADCMIC_GPIO5  = 0x15U, /**< GPIO 5  */
    CY_ADCMIC_GPIO4  = 0x14U, /**< GPIO 4  */
    CY_ADCMIC_GPIO3  = 0x13U, /**< GPIO 3  */
    CY_ADCMIC_GPIO2  = 0x12U, /**< GPIO 2  */
    CY_ADCMIC_GPIO1  = 0x11U, /**< GPIO 1  */
    CY_ADCMIC_GPIO0  = 0x10U  /**< GPIO 0  */
} cy_en_adcmic_dc_channel_t;

/** The DC convergence time */
typedef enum
{
    CY_ADCMIC_DC_CONV_TIME_10_US = 0U,    /**< DC convergence time of 10us */
    CY_ADCMIC_DC_CONV_TIME_15_US = 1U,    /**< DC convergence time of 15us */
    CY_ADCMIC_DC_CONV_TIME_20_US = 2U     /**< DC convergence time of 20us */
} cy_en_adcmic_dc_conv_time_t;

