RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_adcmic.h
/*******************************************************************************
* Function Name: Cy_ADCMic_Init
****************************************************************************//**
*
* Initializes the ADCMic block from a pre-initialized configuration structure.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \param config
* The pointer to the configuration structure \ref cy_stc_adcmic_config_t.
*
* \return
* The status \ref cy_en_adcmic_status_t.
*
* \funcusage
* \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_MIC
* \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_MIC_OP
*
*******************************************************************************/
cy_en_adcmic_status_t Cy_ADCMic_Init(MXS40ADCMIC_Type * base, cy_stc_adcmic_config_t const * config);


/*******************************************************************************
* Function Name: Cy_ADCMic_InitBiquad
****************************************************************************//**
*
* Initializes the biquad filter coefficients.
* Usually is called from the \ref Cy_ADCMic_Init.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \param biQuadConfig
* The pointer to the biquad filter configuration structure \ref cy_stc_adcmic_biquad_config_t.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_BIQUAD_INIT
*
*******************************************************************************/
void Cy_ADCMic_InitBiquad(MXS40ADCMIC_Type * base, cy_stc_adcmic_biquad_config_t const * biQuadConfig);


/*******************************************************************************
* Function Name: Cy_ADCMic_BiquadBypass
****************************************************************************//**
*
* Bypasses/unbypasses the biquad filter.
* Usually is called from the \ref Cy_ADCMic_Init.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \param bypass
* The boolean specifier to bypass(true) or unbypass(false) the biquad filter.
*
*******************************************************************************/
__STATIC_INLINE void Cy_ADCMic_BiquadBypass(MXS40ADCMIC_Type * base, bool bypass)
{
    CY_REG32_CLR_SET(base->AUXADC_CTRL, MXS40ADCMIC_AUXADC_CTRL_BIQUAD_BYPASS, (bypass) ? 1UL : 0UL);
}


/*******************************************************************************
* Function Name: Cy_ADCMic_Enable
****************************************************************************//**
*
* Enables the ADCMic block clocking.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_MIC_OP
*
*******************************************************************************/
__STATIC_INLINE void Cy_ADCMic_Enable (MXS40ADCMIC_Type * base)
{
    base->ADCMIC_CTRL |= MXS40ADCMIC_ADCMIC_CTRL_ADCMIC_EN_Msk;
}


/*******************************************************************************
* Function Name: Cy_ADCMic_Disable
****************************************************************************//**
*
* Disables the ADCMic block clocking.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_STOP
*
*******************************************************************************/
__STATIC_INLINE void Cy_ADCMic_Disable(MXS40ADCMIC_Type * base)
{
    base->ADCMIC_CTRL &= ~MXS40ADCMIC_ADCMIC_CTRL_ADCMIC_EN_Msk;
}


/*******************************************************************************
* Function Name: Cy_ADCMic_SelectSource
****************************************************************************//**
*
* Selects the specified ADC source.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \param source
* The source value \ref cy_en_adcmic_source_t.
*
* \note When the source is switched, the sample rate and the DC conversion
*       time (in case of switching to DC) are also reset accordingly:
*       - if switch to \ref CY_ADCMIC_DC the sample rate
*         is reset to \ref CY_ADCMIC_480KSPS and the DC conversion time
*         is reset to \ref CY_ADCMIC_DC_CONV_TIME_10_US.
*       - if switch to \ref CY_ADCMIC_MIC or \ref CY_ADCMIC_PDM the sample rate
*         is reset to \ref CY_ADCMIC_16KSPS.
*
* \return
* The status \ref cy_en_adcmic_status_t.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_SS
*
*******************************************************************************/
cy_en_adcmic_status_t Cy_ADCMic_SelectSource(MXS40ADCMIC_Type * base, cy_en_adcmic_source_t source);


/*******************************************************************************
* Function Name: Cy_ADCMic_SetSampleRate
****************************************************************************//**
*
* Sets the specified ADC sample rate.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \param sampleRate
* The source value \ref cy_en_adcmic_sample_rate_t.
*
* \note \ref CY_ADCMIC_480KSPS is the only valid value for the \ref CY_ADCMIC_DC input,
*       \ref CY_ADCMIC_8KSPS and \ref CY_ADCMIC_16KSPS are the only valid values for
*       the audio/mic inputs (\ref CY_ADCMIC_MIC or \ref CY_ADCMIC_PDM).
*
* \return
* The status \ref cy_en_adcmic_status_t.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_MIC_OP
*
*******************************************************************************/
cy_en_adcmic_status_t Cy_ADCMic_SetSampleRate(MXS40ADCMIC_Type * base, cy_en_adcmic_sample_rate_t sampleRate);


/*******************************************************************************
* Function Name: Cy_ADCMic_StartConvert
****************************************************************************//**
*
* Starts the conversion process.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_DC_OP
*
*******************************************************************************/
__STATIC_INLINE void Cy_ADCMic_StartConvert(MXS40ADCMIC_Type * base)
{
    base->AUXADC_CTRL |= MXS40ADCMIC_AUXADC_CTRL_EN_Msk;
}


