RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_adcmic.h
/*******************************************************************************
* Function Name: Cy_ADCMic_StopConvert
****************************************************************************//**
*
* Stops the conversion process.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_STOP
*
*******************************************************************************/
__STATIC_INLINE void Cy_ADCMic_StopConvert(MXS40ADCMIC_Type * base)
{
    base->AUXADC_CTRL &= ~MXS40ADCMIC_AUXADC_CTRL_EN_Msk;
}


/*******************************************************************************
* Function Name: Cy_ADCMic_ClearTrigger
****************************************************************************//**
*
* Clears the specified trigger signal.
*
* \param base
* The pointer to the hardware ADC block.
*
* \param trigMask
* The mask of triggers to clear.
* Select one or more masks from \ref group_adcmic_macros_triggers and "OR" them together:
* - \ref CY_ADCMIC_TRIG_DC
* - \ref CY_ADCMIC_TRIG_DATA
*
*******************************************************************************/
__STATIC_INLINE void Cy_ADCMic_ClearTrigger(MXS40ADCMIC_Type * base, uint32_t trigMask)
{
    base->ADCMIC_TRIGGER_CLR = trigMask & CY_ADCMIC_TRIG;
}
/** \} group_adcmic_functions_basic */

/** \addtogroup group_adcmic_functions_mic
* This set of functions is for analog microphone resources control
* \{
*/

/*******************************************************************************
* Function Name: Cy_ADCMic_SetPgaGain
****************************************************************************//**
*
* Configures the PGA gain (0dB to 42dB in steps of 1dB)
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \param gain
* The gain value \ref cy_en_adcmic_pga_gain_t.
*
* \return
* The status \ref cy_en_adcmic_status_t.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_GAIN
*
*******************************************************************************/
cy_en_adcmic_status_t Cy_ADCMic_SetPgaGain(MXS40ADCMIC_Type * base, cy_en_adcmic_pga_gain_t gain);


/*******************************************************************************
* Function Name: Cy_ADCMic_SleepMic
****************************************************************************//**
*
* Shuts down the MIC bias and PGA.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_AP
*
*******************************************************************************/
__STATIC_INLINE void Cy_ADCMic_SleepMic(MXS40ADCMIC_Type * base)
{
    base->ADC_PD_CTRL &= ~MXS40ADCMIC_ADC_PD_CTRL_MIC_PWRUP_Msk;
}


/*******************************************************************************
* Function Name: Cy_ADCMic_WakeUpMic
****************************************************************************//**
*
* Turns on the MIC bias and PGA.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_AP
*
*******************************************************************************/
__STATIC_INLINE void Cy_ADCMic_WakeUpMic(MXS40ADCMIC_Type * base)
{
    base->ADC_PD_CTRL |= MXS40ADCMIC_ADC_PD_CTRL_MIC_PWRUP_Msk;
}
/** \} group_adcmic_functions_mic */

/** \addtogroup group_adcmic_functions_timer
* This set of functions is for Timer control
* \{
*/

/*******************************************************************************
* Function Name: Cy_ADCMic_EnableTimer
****************************************************************************//**
*
* Enables the timer.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_TIMER
*
*******************************************************************************/
__STATIC_INLINE void Cy_ADCMic_EnableTimer(MXS40ADCMIC_Type * base)
{
    base->ADCMIC_TRIG_INTRPT_TIMER_CTRL &= ~MXS40ADCMIC_ADCMIC_TRIG_INTRPT_TIMER_CTRL_TIMER_CLR_Msk;
    (void)base->ADCMIC_TRIG_INTRPT_TIMER_CTRL; /* Dummy read to ensure write is done before return */
}


/*******************************************************************************
* Function Name: Cy_ADCMic_DisableTimer
****************************************************************************//**
*
* Disables the timer.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_TIMER
*
*******************************************************************************/
__STATIC_INLINE void Cy_ADCMic_DisableTimer(MXS40ADCMIC_Type * base)
{
    base->ADCMIC_TRIG_INTRPT_TIMER_CTRL |= MXS40ADCMIC_ADCMIC_TRIG_INTRPT_TIMER_CTRL_TIMER_CLR_Msk;
    (void)base->ADCMIC_TRIG_INTRPT_TIMER_CTRL; /* Dummy read to ensure write is done before return */
}


/*******************************************************************************
* Function Name: Cy_ADCMic_SetTimerPeriod
****************************************************************************//**
*
* Sets the timer period.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \param period
* The 16-bit timer period.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_TIMER
*
*******************************************************************************/
__STATIC_INLINE void Cy_ADCMic_SetTimerPeriod(MXS40ADCMIC_Type * base, uint16_t period)
{
    CY_REG32_CLR_SET(base->ADCMIC_TRIG_INTRPT_TIMER_CTRL, MXS40ADCMIC_ADCMIC_TRIG_INTRPT_TIMER_CTRL_TIMER_LIMIT, period);
}
/** \} group_adcmic_functions_timer */

/** \addtogroup group_adcmic_functions_dc
* This set of functions is for DC measurement mode
* \{
*/

/*******************************************************************************
* Function Name: Cy_ADCMic_SelectDcChannel
****************************************************************************//**
*
* Sets the specified DC measurement channel.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \param dcChannel
* The DC measurement channel \ref cy_en_adcmic_dc_channel_t.
*
* \note This function is useful for DC measurement only.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_DC_OP
*
*******************************************************************************/
void Cy_ADCMic_SelectDcChannel(MXS40ADCMIC_Type * base, cy_en_adcmic_dc_channel_t dcChannel);


