RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_adcmic.h
/*******************************************************************************
* Function Name: Cy_ADCMic_SetDcConvTime
****************************************************************************//**
*
* Sets the specified DC conversion time.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \param time
* The source value \ref cy_en_adcmic_dc_conv_time_t.
*
* \note This function call is useful for DC measurement only.
*       For other ADC sources \ref CY_ADCMIC_BAD_PARAM is returned.
*
* \return
* The status \ref cy_en_adcmic_status_t.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_SS
*
*******************************************************************************/
cy_en_adcmic_status_t Cy_ADCMic_SetDcConvTime(MXS40ADCMIC_Type * base, cy_en_adcmic_dc_conv_time_t time);


/*******************************************************************************
* Function Name: Cy_ADCMic_IsEndConversion
****************************************************************************//**
*
* Immediately return the status of the conversion or does not return (blocking)
* until the conversion completes, depending on the retMode parameter.
* In blocking mode, there is a time out of about 10 seconds for a CPU speed of
* 100 MHz.
*
* \param base
* Pointer to structure describing registers
*
* \param retMode
* A value of the enum \ref cy_en_adcmic_return_mode_t
*
* \return
* - \ref CY_ADCMIC_SUCCESS : the last conversion is complete
* - \ref CY_ADCMIC_CONVERSION_NOT_COMPLETE : the conversion has not completed
* - \ref CY_ADCMIC_TIMEOUT : the watchdog timer has expired in blocking mode
*
* \sideeffect
* This function reads the end of conversion status interrupt bit and clears it after.
*
* \note
* \ref CY_ADCMIC_WAIT_FOR_RESULT return modes are not recommended
* for use in RTOS environment.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_DC_OP
*
*******************************************************************************/
cy_en_adcmic_status_t Cy_ADCMic_IsEndConversion (MXS40ADCMIC_Type * base, cy_en_adcmic_return_mode_t retMode);


/*******************************************************************************
* Function Name: Cy_ADCMic_GetDcResult
****************************************************************************//**
*
* Returns the DC conversion result from the CIC status register.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \return
* The signed DC conversion result.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_DC_OP
*
*******************************************************************************/
__STATIC_INLINE int16_t Cy_ADCMic_GetDcResult(MXS40ADCMIC_Type * base)
{
    return ((int16_t)((uint16_t)_FLD2VAL(MXS40ADCMIC_AUXADC_CIC_STATUS_CIC, base->AUXADC_CIC_STATUS)));
}


/*******************************************************************************
* Function Name: Cy_ADCMic_CountsTo_mVolts
****************************************************************************//**
*
* Convert the ADC output to millivolts as an int16. For example, if the ADC
* measured 0.534 volts, the return value would be 534.
* The calculation of voltage depends on the DC range.
* The equation used is:
*
*     mV = (RawCounts - Offset) * 1000 / Gain
*
* where,
* - RawCounts: Raw counts returned by the \ref Cy_ADCMic_GetDcResult.
* - Offset - the offset value, can be adjusted by the \ref Cy_ADCMic_SetDcOffset,
*   essentially it is a raw count value of the \ref CY_ADCMIC_REFGND voltage measurement.
* - 1000 - amount of millivolts in 1 volt
* - Gain: the gain value, can be adjusted by the \ref Cy_ADCMic_SetDcGain, depends on DC range,
*   essentially it is an amount of raw counts per 1 volt of input voltage.
*
* \note
* This function is for DC measurement only.
*
* \param base
* Pointer to structure describing registers
*
* \param adcCounts
* Conversion result from \ref Cy_ADCMic_GetDcResult
*
* \return
* Result in millivolts.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_COUNTS_TO_MVOLTS
*
*******************************************************************************/
int16_t Cy_ADCMic_CountsTo_mVolts(MXS40ADCMIC_Type const * base, int16_t adcCounts);


/*******************************************************************************
* Function Name: Cy_ADCMic_CountsTo_uVolts
****************************************************************************//**
*
* Convert the ADC output to microvolts as an int32. For example, if the ADC
* measured 0.534 volts, the return value would be 534000.
* The calculation of voltage depends on the DC range.
* The equation used is:
*
*     uV = (RawCounts - Offset) * 1000000 / Gain
*
* where,
* - RawCounts: Raw counts returned by the \ref Cy_ADCMic_GetDcResult.
* - Offset - the offset value, can be adjusted by the \ref Cy_ADCMic_SetDcOffset,
*   essentially it is a raw count value of the \ref CY_ADCMIC_REFGND voltage measurement.
* - 1000000 - amount of microvolts in 1 volt
* - Gain: the gain value, can be adjusted by the \ref Cy_ADCMic_SetDcGain, depends on DC range,
*   essentially it is an amount of raw counts per 1 volt of input voltage.
*
* \note
* This function is for DC measurement only.
*
* \param base
* Pointer to structure describing registers
*
* \param adcCounts
* Conversion result from \ref Cy_ADCMic_GetDcResult
*
* \return
* Result in microvolts.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_COUNTS_TO_UVOLTS
*
*******************************************************************************/
int32_t Cy_ADCMic_CountsTo_uVolts(MXS40ADCMIC_Type const * base, int16_t adcCounts);


/*******************************************************************************
* Function Name: Cy_ADCMic_CountsTo_Volts
****************************************************************************//**
*
* Convert the ADC output to volts as a float. For example, if the ADC
* measured 0.534 volts, the return value would be 0.534.
* The calculation of voltage depends on the DC range.
* The equation used is:
*
*     V = (RawCounts - Offset) / Gain
*
* where,
* - RawCounts: Raw counts returned by the \ref Cy_ADCMic_GetDcResult.
* - Offset - the offset value, can be adjusted by the \ref Cy_ADCMic_SetDcOffset,
*   essentially it is a raw count value of the \ref CY_ADCMIC_REFGND voltage measurement.
* - Gain: the gain value, can be adjusted by the \ref Cy_ADCMic_SetDcGain, depends on DC range,
*   essentially it is an amount of raw counts per 1 volt of input voltage.
*
* \note
* This function is for DC measurement only.
*
* \param base
* Pointer to structure describing registers
*
* \param adcCounts
* Conversion result from \ref Cy_ADCMic_GetDcResult
*
* \return
* Result in volts.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_COUNTS_TO_VOLTS
*
*******************************************************************************/
float Cy_ADCMic_CountsTo_Volts(MXS40ADCMIC_Type const * base, int16_t adcCounts);
/** \} group_adcmic_functions_dc */

/** \addtogroup group_adcmic_functions_interrupt
* This set of functions are related to ADCMic interrupts.
* \{
*/

