RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_adcmic.h
/*******************************************************************************
* Function Name: Cy_ADCMic_ReadFifoAll
****************************************************************************//**
*
* Reads whole the FIFO payload into the data array.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \param data
* The pointer to the uint16_t data array for the FIFO payload.
*
* \return
* The 8-bit FIFO data count.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_ISR
*
*******************************************************************************/
uint8_t Cy_ADCMic_ReadFifoAll(MXS40ADCMIC_Type const * base, uint16_t * data);


/*******************************************************************************
* Function Name: Cy_ADCMic_ReadFifoStatus
****************************************************************************//**
*
* Returns the fifo status.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \return
* The 8-bit fifo status, see \ref group_adcmic_macros_fifo_status.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_ISR
*
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_ADCMic_GetFifoStatus(MXS40ADCMIC_Type const * base)
{
    return ((uint8_t)_FLD2VAL(MXS40ADCMIC_ADCMIC_FIFO_CTRL_FIFO_STATUS, base->ADCMIC_FIFO_CTRL));
}


/*******************************************************************************
* Function Name: Cy_ADCMic_ReadFifo
****************************************************************************//**
*
* Low-level API which returns the ADCMIC_DATA register value
* that contains \b two subsequent FIFO data samples.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \return
* The combined 32-bit value of two 16-bit samples.
* Use \ref group_adcmic_macros_fifo_samples to parse it.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_READ_FIFO
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_ADCMic_ReadFifo(MXS40ADCMIC_Type const * base)
{
    return (base->ADCMIC_DATA);
}


/*******************************************************************************
* Function Name: Cy_ADCMic_SetDcOffset
****************************************************************************//**
*
* Sets the offset value for DC measurement calibration.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \param offset
* The offset value.
*
*******************************************************************************/
void Cy_ADCMic_SetDcOffset(MXS40ADCMIC_Type const * base, int16_t offset);


/*******************************************************************************
* Function Name: Cy_ADCMic_SetDcGain
****************************************************************************//**
*
* Sets the gain value for DC measurement calibration.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \param gain
* The gain value.
*
*******************************************************************************/
void Cy_ADCMic_SetDcGain(MXS40ADCMIC_Type const * base, int16_t gain);

/** \} group_adcmic_functions_fifo */

/** \} group_adcmic_functions */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXS40ADCMIC */

#endif  /* (CY_ADCMIC_H) */

/** \} group_adcmic */

/* [] END OF FILE */
